app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-09-04 22:05:01.863212"], ["id", 1]]
---
  def update
     @student.update(student_params(:first_name,:last_name))